
&НаСервереБезКонтекста
Функция УслугиРаботаПриИзмененииСервере(СтруктураДанные)
	СтруктураДанные.Вставить("ЕдиницаИзмерения", СтруктураДанные.Номенклатура.ЕдИзм);
	СтруктураДанные.Вставить("Цена", СтруктураДанные.Номенклатура.ЦенаТовара+СтруктураДанные.Номенклатура.ЦенаУслуги);
	Возврат  СтруктураДанные;
КонецФункции

&НаКлиенте
Процедура ПересчитатьСумму(СТЧ)
	СТЧ.Сумма = СТЧ.Цена * СТЧ.Количество;
КонецПроцедуры	

&НаКлиенте
Процедура УслугиРаботаПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Работа);
	СтруктураДанные = УслугиРаботаПриИзмененииСервере(СтруктураДанные);
	СтрокаТабличнойЧасти.ЕдИзм = СтруктураДанные.ЕдиницаИзмерения;
	СтрокаТабличнойЧасти.Цена = СтруктураДанные.Цена;
	ПересчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	ПересчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура УслугиВидРаботПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	СтрокаТабличнойЧасти.ЕдИзм = Неопределено;
	СтрокаТабличнойЧасти.Цена = 0;
	СтрокаТабличнойЧасти.Сумма = 0;
КонецПроцедуры