&НаКлиенте
Процедура ВыполнитьОбмен()
	ОбменДаннымиКлиент.ОбменДаннымиСОАП();
КонецПроцедуры	

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Оповещение = Новый ОписаниеОповещения("ВопросЗавершение", ЭтотОбъект); 
	ТекстВопроса = "Сейчас будет выполнена синхронизация. Продолжить?"; 
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("ОбщаяФорма.", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

&НаКлиенте
Процедура ВопросЗавершение(Результат, ДополнительныеПараметры)
	Если Результат = КодВозвратаДиалога.Да Тогда 
		ВыполнитьОбмен();
	КонецЕсли;
КонецПроцедуры
