
Функция ТекущийПользовательИБ() Экспорт
	Возврат ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
КонецФункции

Функция ТекущийПользователь() Экспорт
	Возврат ПараметрыСеанса.ТекущийПользователь;
КонецФункции

Функция ТекущийПользовательИд() Экспорт
	Возврат ПараметрыСеанса.ТекущийПользователь.Ид;
КонецФункции

Функция ТекущаяРоль() Экспорт
	Возврат Строка(ПараметрыСеанса.ТекущийПользователь.Роль);
КонецФункции

Функция ТекущийКонтрагент() Экспорт
	Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	РегКИ1=РегистрыСведений.НастройкиПользователя.СоздатьНаборЗаписей();
	РегКИ1.Отбор.Пользователь.Установить(ТекущийПользователь());
	РегКИ1.Прочитать();
    Если РегКИ1.Количество()>0 Тогда
    	Контрагент = РегКИ1.Получить(0).Контрагент;
	КонецЕсли;
	Возврат Контрагент;
КонецФункции

Функция ПолучитьИдКонтрагента() Экспорт
	Контрагент = "";
	РегКИ1=РегистрыСведений.НастройкиПользователя.СоздатьНаборЗаписей();
	РегКИ1.Отбор.Пользователь.Установить(ТекущийПользователь());
	РегКИ1.Прочитать();
    Если РегКИ1.Количество()>0 Тогда
    	Контрагент = РегКИ1.Получить(0).Контрагент.Ид;
	КонецЕсли;
	Возврат Контрагент;

КонецФункции	