
Процедура ПриНачалеРаботыСистемы()
	//ТекущийПользователь = МобильноеПриложениеСервер.ТекущийПользователь();
	//ПервыйСтарт = МобильноеПриложениеСервер.ПолучитьЗначениеКонстантыПервыйЗапуск();
	НомерВерсииИБ = ОбновлениеСлужебный.ВерсияИБ("SigrandMobile");
	ПервыйЗапуск = НомерВерсииИБ = "0.0.0.0";
	НомерВерсии = ОбновлениеСлужебный.ВерсияМетаданных()["Версия"];
	Если ПервыйЗапуск Тогда
		//НачатьТранзакцию();
		//ОткрытьФорму("Обработка.ПервыйСтарт.Форма.Форма",,,,,,,);
		ОбновлениеСлужебный.ПервыйЗапуск();
		//ЗафиксироватьТранзакцию();
	ИначеЕсли НомерВерсииИБ <> НомерВерсии Тогда
		ОбновлениеСлужебный.ОбновлениеИнформационнойБазы();		
	КонецЕсли;
	
КонецПроцедуры
