
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	//Если ЗначениеЗаполнено(ПользователиИнформационнойБазы.ТекущийПользователь().Имя) Тогда
		Польз = Справочники.Пользователи.НайтиПоНаименованию(ПользователиИнформационнойБазы.ТекущийПользователь().Имя);
				//Если Польз.Пустая() Тогда
				//	ПользОбъект = Справочники.Пользователи.СоздатьЭлемент();
				//	ПользОбъект.Наименование = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
				//	ПользОбъект.УстановитьНовыйКод();
				//	ПользОбъект.ИдентификаторПользователяИБ = ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор;
				//	ПользОбъект.Записать();
				//	Польз = ПользОбъект.Ссылка;
				//КонецЕсли;
		ПараметрыСеанса.ТекущийПользователь = Польз;		
	//КонецЕсли;	
КонецПроцедуры
