
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	Если ЗначениеЗаполнено(МобильноеПриложениеСервер.ТекущийПользовательИБ()) Тогда
		ЭтаФорма.Заголовок = Метаданные.Синоним + " - " + МобильноеПриложениеСервер.ТекущийПользовательИБ();
	Иначе
		ЭтаФорма.Заголовок = Метаданные.Синоним + " - Не авторизован";
		ЭтаФорма.Элементы.РабочаяГруппа.Доступность = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура НастройкаНаСервере()
	
КонецПроцедуры
