
&НаКлиенте
Процедура ОплатыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.ДатаОплаты = ТекущаяДата();
		Элемент.ТекущиеДанные.Замерщик = МобильноеПриложениеСервер.ТекущийКонтрагент();
		Элемент.ТекущиеДанные.ПользовательИд = МобильноеПриложениеСервер.ТекущийПользовательИд();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОплатыРаботы(Команда)
	ИзменитьВидимостьЗакладок(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция УслугиРаботаПриИзмененииСервере(СтруктураДанные)
	СтруктураДанные.Вставить("ЕдиницаИзмерения", СтруктураДанные.Номенклатура.ЕдИзм);
	СтруктураДанные.Вставить("Цена", СтруктураДанные.Номенклатура.ЦенаТовара+СтруктураДанные.Номенклатура.ЦенаУслуги);
	Возврат  СтруктураДанные;
КонецФункции

&НаКлиенте
Процедура ПересчитатьСумму(СТЧ)
	СТЧ.Сумма = СТЧ.Цена * СТЧ.Количество;
КонецПроцедуры	

&НаКлиенте
Процедура УслугиРаботаПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Работа);
	СтруктураДанные = УслугиРаботаПриИзмененииСервере(СтруктураДанные);
	СтрокаТабличнойЧасти.ЕдИзм = СтруктураДанные.ЕдиницаИзмерения;
	СтрокаТабличнойЧасти.Цена = СтруктураДанные.Цена;
	ПересчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	ПересчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура УслугиВидРаботПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	СтрокаТабличнойЧасти.ЕдИзм = Неопределено;
	СтрокаТабличнойЧасти.Цена = 0;
	СтрокаТабличнойЧасти.Сумма = 0;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
	ИзменитьВидимостьЗакладок();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	ТекущаяРоль =  МобильноеПриложениеСервер.ТекущаяРоль();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	КонтактнаяИнформация.Адрес,
	               |	КонтактнаяИнформация.Телефон
	               |ИЗ
	               |	Справочник.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Владелец = &Владелец
	               |	И КонтактнаяИнформация.Адрес <> НЕОПРЕДЕЛЕНО";
	Запрос.УстановитьПараметр("Владелец", Объект.Контрагент);
	Рез = Запрос.Выполнить().Выбрать();
	Значение = Рез.Следующий();
	Если Значение Тогда
		ЭтаФорма.Адрес = Рез.Адрес;
		ЭтаФорма.Элементы.КнопкаПозвонить.Заголовок = Рез.Телефон;
		Если ЗначениеЗаполнено(Рез.Телефон) Тогда
			ЭтаФорма.Элементы.КнопкаПозвонить.Доступность = Истина;
		Иначе
			ЭтаФорма.Элементы.КнопкаПозвонить.Заголовок = "Позвонить";
			ЭтаФорма.Элементы.КнопкаПозвонить.Доступность = Ложь;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Рез.Адрес) Тогда
			ЭтаФорма.Элементы.НайтиНаКарте.Доступность = Истина;
		Иначе
			ЭтаФорма.Элементы.НайтиНаКарте.Заголовок = "Найти на карте";
			ЭтаФорма.Элементы.НайтиНаКарте.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущаяРоль) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.Город = Объект.Контрагент.Город.Наименование;
	
	Если ТекущаяРоль = "Замерщик" Тогда
		ЭтаФорма.Элементы.Замерщик.Доступность = Ложь;
	Иначе
		ЭтаФорма.Элементы.Замерщик.Доступность = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Позвонить(Команда)
#Если МобильноеПриложениеКлиент Тогда
	Если СредстваТелефонии.ПоддерживаетсяНаборНомера() Тогда
	СредстваТелефонии.НабратьНомер(ЭтаФорма.Элементы.КнопкаПозвонить.Заголовок,Ложь);
	Иначе
		Сообщить("Не поддерживается набор номера");
	КонецЕсли;
#Иначе	
	ЗапуститьПриложение("tel: "+ЭтаФорма.Элементы.КнопкаПозвонить.Заголовок);
#КонецЕсли	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВидимостьЗакладок(Шапка = Истина)
	Если Шапка Тогда 
		ЭтаФорма.Элементы.Шапка.Видимость = Истина;
		ЭтаФорма.Элементы.Страницы.Видимость = Ложь;
	Иначе
		ЭтаФорма.Элементы.Шапка.Видимость = Ложь;
		ЭтаФорма.Элементы.Страницы.Видимость = Истина;
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура НайтиНаКарте(Команда)
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.Адрес) Тогда
		Возврат;
	КонецЕсли;
#Если МобильноеПриложениеКлиент Тогда
	ПолныйАдрес = ЭтаФорма.Город + ", " + ЭтаФорма.Адрес;
//#Если МобильноеПриложениеКлиент Тогда	
	СтруктураКоординат = ОбменДаннымиКлиент.ПолучитьКоординатыПоАдресу(ПолныйАдрес);
	Попытка
		Координаты = Новый ГеографическиеКоординаты(СтруктураКоординат.lat,СтруктураКоординат.lng);
		ПоказатьНаКарте(Координаты);
	Исключение
		Сообщить("Невозможно отобразить адрес!");
	КонецПопытки;	
#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура РеквизитыДоговора(Команда)
	ИзменитьВидимостьЗакладок();
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.Замерщик = МобильноеПриложениеСервер.ТекущийКонтрагент();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПодборПоРасчету(Команда)
	//Оповещение = Новый ОписаниеОповещения("ВопросЗавершение", ЭтотОбъект); 
	//ТекстВопроса = "Сейчас будет выполнена синхронизация. Продолжить?"; 
	//ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);

	
	ОписаниеОповещенияПриЗакрытииПодбора = Новый ОписаниеОповещения("ПриЗакрытииПодбора", ЭтотОбъект);
	ОткрытьФорму("Документ.Расчеты.Форма.ФормаВыбора",,,,,,ОписаниеОповещенияПриЗакрытииПодбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

//Процедура ВопросЗавершение(Результат, ДополнительныеПараметры)
//	Если Результат = КодВозвратаДиалога.Да Тогда 
//		ВыполнитьОбмен();
//	КонецЕсли;
//КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииПодбора(РезультатЗакрытия, ДополнительныеПараметры)
	Если ТипЗнч(РезультатЗакрытия) = Тип("ДокументСсылка.Расчеты") Тогда
		Объект.Услуги.Очистить();
		Для Каждого Строка Из РезультатЗакрытия.Услуги Цикл
			НоваяСтрока = Объект.Услуги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
		КонецЦикла;
		ЭтотОбъект.Модифицированность = Истина;
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ТекущаяРоль = МобильноеПриложениеСервер.ТекущаяРоль();
	Если ТекущаяРоль = "Замерщик" Тогда
		Для Каждого Строка Из Объект.Услуги Цикл
			Если Строка.Замерщик.Пустая() Тогда
				Сообщить("В табличной части Услуги замерщик не может быть пустым!");
				Отказ = Истина;
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры
