
Процедура ПередЗаписью(Отказ)
	
	УИПустой = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	ИмяВыходногоФайла = ПолучитьИмяВременногоФайла("xml");
	Запрос = "select soap.get_access_from_key('"+Наименование+"','"+КлючДоступа+"') enbl from dual";
	ОбменДаннымиСервер.ВернутьSOAPОтвет(Запрос, ИмяВыходногоФайла);
	Отказ = НЕ ОбменДаннымиСервер.ПользовательРазрешенXML(ИмяВыходногоФайла);
	Если НЕ Отказ Тогда
		Ид = ОбменДаннымиСервер.ПолучитьИдентификаторПользователя(Наименование);
		Если ОбменДаннымиСервер.ПользовательЯвляетсяАдминистратором(Наименование) тогда
		ИдентификаторПользователяИБ = ОбновлениеСлужебный.СоздатьПользователя(
			?(ИдентификаторПользователяИБ = УИПустой, Наименование, ИдентификаторПользователяИБ),
			Наименование,
			Метаданные.Роли.ПолныеПрава);
			Роль = Перечисления.РолиПользователя.Администратор;
		ИначеЕсли ОбменДаннымиСервер.ПользовательЯвляетсяДиспетчером(Наименование) тогда
			ИдентификаторПользователяИБ = ОбновлениеСлужебный.СоздатьПользователя(
			?(ИдентификаторПользователяИБ = УИПустой, Наименование, ИдентификаторПользователяИБ),
			Наименование,
			Метаданные.Роли.Диспетчер);
			Роль = Перечисления.РолиПользователя.Диспетчер;
		ИначеЕсли ОбменДаннымиСервер.ПользовательЯвляетсяЗамерщиком(Наименование) тогда
			ИдентификаторПользователяИБ = ОбновлениеСлужебный.СоздатьПользователя(
			?(ИдентификаторПользователяИБ = УИПустой, Наименование, ИдентификаторПользователяИБ),
			Наименование,
			Метаданные.Роли.Замерщик);
			Роль = Перечисления.РолиПользователя.Замерщик;
		ИначеЕсли ОбменДаннымиСервер.ПользовательЯвляетсяДиректором(Наименование) тогда
			ИдентификаторПользователяИБ = ОбновлениеСлужебный.СоздатьПользователя(
			?(ИдентификаторПользователяИБ = УИПустой, Наименование, ИдентификаторПользователяИБ),
			Наименование,
			Метаданные.Роли.Директор);
			Роль = Перечисления.РолиПользователя.Директор;	
		Иначе
			ВызватьИсключение("Этот пользователь не имеет прав на работу в мобильном приложении!");
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры
