
&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция УслугиРаботаПриИзмененииСервере(СтруктураДанные)
	СтруктураДанные.Вставить("ЕдиницаИзмерения", СтруктураДанные.Номенклатура.ЕдИзм);
	СтруктураДанные.Вставить("Цена", СтруктураДанные.Номенклатура.ЦенаТовара+СтруктураДанные.Номенклатура.ЦенаУслуги);
	Возврат  СтруктураДанные;
КонецФункции

&НаКлиенте
Процедура ПересчитатьСумму(СТЧ)
	СТЧ.Сумма = СТЧ.Цена * СТЧ.Количество;
КонецПроцедуры	

&НаКлиенте
Процедура УслугиРаботаПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Работа);
	СтруктураДанные = УслугиРаботаПриИзмененииСервере(СтруктураДанные);
	СтрокаТабличнойЧасти.ЕдИзм = СтруктураДанные.ЕдиницаИзмерения;
	СтрокаТабличнойЧасти.Цена = СтруктураДанные.Цена;
	ПересчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	ПересчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура УслугиВидРаботПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	СтрокаТабличнойЧасти.ЕдИзм = Неопределено;
	СтрокаТабличнойЧасти.Цена = 0;
	СтрокаТабличнойЧасти.Сумма = 0;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	ТекущаяРоль =  МобильноеПриложениеСервер.ТекущаяРоль();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	КонтактнаяИнформация.Адрес,
	               |	КонтактнаяИнформация.Телефон
	               |ИЗ
	               |	Справочник.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Владелец = &Владелец
	               |	И КонтактнаяИнформация.Адрес <> НЕОПРЕДЕЛЕНО";
	Запрос.УстановитьПараметр("Владелец", Объект.Контрагент);
	Рез = Запрос.Выполнить().Выбрать();
	Значение = Рез.Следующий();
	Если Значение Тогда
		ЭтаФорма.Адрес = Рез.Адрес;
		ЭтаФорма.Элементы.КнопкаПозвонить.Заголовок = Рез.Телефон;
		Если ЗначениеЗаполнено(Рез.Телефон) Тогда
			ЭтаФорма.Элементы.КнопкаПозвонить.Доступность = Истина;
		Иначе
			ЭтаФорма.Элементы.КнопкаПозвонить.Заголовок = "Позвонить";
			ЭтаФорма.Элементы.КнопкаПозвонить.Доступность = Ложь;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Рез.Адрес) Тогда
			ЭтаФорма.Элементы.НайтиНаКарте.Доступность = Истина;
		Иначе
			ЭтаФорма.Элементы.НайтиНаКарте.Заголовок = "Найти на карте";
			ЭтаФорма.Элементы.НайтиНаКарте.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущаяРоль) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущаяРоль = "Замерщик" Тогда
		ЭтаФорма.Элементы.Замерщик.Доступность = Ложь;
	Иначе
		ЭтаФорма.Элементы.Замерщик.Доступность = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Позвонить(Команда)
#Если МобильноеПриложениеКлиент Тогда
	Если СредстваТелефонии.ПоддерживаетсяНаборНомера() Тогда
	СредстваТелефонии.НабратьНомер(ЭтаФорма.Элементы.КнопкаПозвонить.Заголовок,Ложь);
	Иначе
		Сообщить("Не поддерживается набор номера");
	КонецЕсли;
#Иначе	
	ЗапуститьПриложение("tel: "+ЭтаФорма.Элементы.КнопкаПозвонить.Заголовок);
#КонецЕсли	
КонецПроцедуры

&НаКлиенте
Процедура НайтиНаКарте(Команда)
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.Адрес) Тогда
		Возврат;
	КонецЕсли;
#Если МобильноеПриложениеКлиент Тогда	
	СтруктураКоординат = ОбменДаннымиКлиент.ПолучитьКоординатыПоАдресу(ЭтаФорма.Адрес);
	Координаты = Новый ГеографическиеКоординаты(СтруктураКоординат.lat,СтруктураКоординат.lng);
	ПоказатьНаКарте(Координаты);
#КонецЕсли
КонецПроцедуры
