&НаСервере
Процедура СброситьВсеИзмененияНаСервере()
	ОбменДаннымиСервер.СброситьВсеИзмененияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("ОбщаяФорма.", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	Оповещение = Новый ОписаниеОповещения("ВопросЗавершение", ЭтотОбъект); 
	ТекстВопроса = "Это действие нарушит процесс синхронизации. Продолжить?"; 
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	//Если Вопрос("Вы уверены?",
	//	РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Да Тогда 
	//	СброситьВсеИзмененияНаСервере();
	//КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ВопросЗавершение(Результат, ДополнительныеПараметры)
	Если Результат = КодВозвратаДиалога.Да Тогда 
		СброситьВсеИзмененияНаСервере();
	КонецЕсли;
КонецПроцедуры	
